Tekla.Structures.Drawing.Weld.Representation
The weld representations.

Tekla.Structures.Drawing.Weld.Representation.Outline
The outline solid representation.

Tekla.Structures.Drawing.Weld.Representation.Path
The path representation.